In [20]:
import pandas as pd

In [21]:
df= pd.read_csv('Employees.csv')

In [22]:
df.head()

    Name  Gender      Age  Salary(USD)
0    Mark      M  20.3650         1000
1   John       M  60.3226         1200
2  Edward      M  42.2650         3000
3   Salah      M  31.3800         5000
4   Ahmed      M  42.6800         1700

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         9 non-null      object
 1   Gender       9 non-null      object
 2   Age          9 non-null      float64
 3   Salary(USD)  9 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 416.0+ bytes

In [24]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

In [25]:
df=df.drop_duplicates()

In [26]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [27]:
df['Age']=df['Age'].astype('int')

In [28]:
df.head()

    Name  Gender  Age  Salary(USD)
0    Mark      M   20         1000
1   John       M   60         1200
2  Edward      M   42         3000
3   Salah      M   31         5000
4   Ahmed      M   42         1700

In [31]:
df.rename(columns = {'Salary(USD)':'Salary(EGP)'}, inplace = True)

In [32]:
df['Salary(EGP)']=df['Salary(EGP)']*48

In [39]:
df

    Name  Gender  Age  Salary(EGP)
0    Mark      M   20        48000
1   John       M   60        57600
2  Edward      M   42       144000
3   Salah      M   31       240000
4   Ahmed      M   42        81600
5    Sara      F   25        91200
6   Julia      F   21        93600

In [42]:
print(df['Age'].mean())

34.42857142857143

In [41]:
print(df['Salary(EGP)'].median())

91200.0

In [51]:
males=df[df['Gender']=='M'].value_counts()
print(sum(males))

5

In [52]:
females=df[df['Gender']=='F'].value_counts()
print(sum(females))

2

In [55]:
ration=sum(males)/sum(females)
print(ration)

2.5

In [56]:
df.to_csv('Employees_Updated')